package day0628;

/**
 * for의 다양한 형태
 * @author user
 */
public class TestFor3 {

	public static void main(String[] args) {
		
//		//여러개의 인덱스를 사용할 떄
//		for( int i = 0, j = 10, k = 5; i < 10; i++, j--, k*=2 ) {
//			
//			System.out.println("i = " + i + ", j = " + j + ", k = " + k );
//			
//		}//end for i
		
/////////////////////////////////////////////////////////////////////////////////////////////////
		
		//무한루프
//		for(;;) {//무한으로 반복하는 반복문
//			
//			System.out.println("무한루프");
//			//break; //반복문을 빠져나갈 때
		
//		}//end for
//		
//		System.out.println("-----------------------------"); //무한 루프 반복문 아래에 있으므로 실행되지 않는 코드로 error가 발생한다.
		
//////////////////////////////////////////////////////////////////////////////////////////////////////
		
		//무한 루프 셀 수 있는
		
//		for ( int cnt = 0; ; cnt++ ) { //숫자 무한루프 반복문
//			
//			System.out.println("무한루프 " + cnt );
//			
//			if ( cnt == 5 ) {
//				break; //무한루프 빠져나갈 때
//			} //end if
//			
//		} //end for
//		System.out.println("출력");
		
/////////////////////////////////////////////////////////////////////////////////////////////////////
		
		
		
		
		
	}//main

}//class
